Tekla Open API Reference for Tekla Structures 2025
ProjectInfo.SetUserProperty Method (String, Double)
 Sets a double property for the ProjectInfo.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool SetUserProperty(
	string Name,
	double Value
)
Public Function SetUserProperty (
	Name As String,
	Value As Double
) As Boolean
Parameters
Name
Type: System.String
The name of the property to be set.
Value
Type: System.Double
The new value for the property.
Return Value
Type: Boolean
True if the property was set successfully.
See Also
Reference
ProjectInfo Class
SetUserProperty Overload
Tekla.Structures.Model Namespace